app/controllers/teacher/feedbacks_controller.rb

    def index
      @feedbacks = TeacherFeedback.includes(submission: [:student, :session]).order(created_at: :desc)
      @feedbacks = @feedbacks.where(status: params[:status]) if params[:status].present?

      @pending_submissions = Submission.where(status: "submitted")
        .left_joins(:teacher_feedback)
        .where(teacher_feedback: { id: nil })
---
SELECT "teacher_feedback".* FROM "teacher_feedback" ORDER BY "teacher_feedback"."created_at" DESC
SELECT "submissions".* FROM "submissions" LEFT OUTER JOIN "teacher_feedback" ON "teacher_feedback"."submission_id" = "submissions"."id" WHERE "submissions"."status" = 'submitted' AND "teacher_feedback"."id" IS NULL

    def set_submission
      @submission = Submission.find(params[:submission_id])
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = 1