app/controllers/teacher/reports_controller.rb

SELECT "reports".* FROM "reports" WHERE "reports"."scope" = 'student' ORDER BY "reports"."created_at" DESC
---
    def index
      @reports = Report.where(scope: "student").includes(submission: :student).order(created_at: :desc)