app/controllers/teacher/submissions_controller.rb

    def index
      @submissions = Submission.includes(:student, :session).order(created_at: :desc)
---
SELECT "submissions".* FROM "submissions" ORDER BY "submissions"."created_at" DESC

    def show
      @submission = Submission.find(params[:id])
      @responses = @submission.responses.includes(:item)
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = 1 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)
SELECT "responses".* FROM "responses" WHERE "responses"."submission_id" = 1