app/controllers/admin/assessment_versions_controller.rb

SELECT "assessment_versions".* FROM "assessment_versions" ORDER BY "assessment_versions"."created_at" DESC
---
    def index
      @assessment_versions = AssessmentVersion.order(created_at: :desc)

SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)
---
    def show
      @items = @assessment_version.items.includes(:passage)

SELECT "assessment_versions".* FROM "assessment_versions" WHERE "assessment_versions"."id" = 1 LIMIT 1
---
    def set_assessment_version
      @assessment_version = AssessmentVersion.find(params[:id])