app/controllers/admin/book_catalogs_controller.rb

    def index
      @books = BookCatalog.order(created_at: :desc)
---
SELECT "book_catalog".* FROM "book_catalog" ORDER BY "book_catalog"."created_at" DESC