app/controllers/admin/dashboard_controller.rb

    def index
      @stats = {
        users: User.count,
        passages: Passage.count,
        items: Item.count,
        assessment_versions: AssessmentVersion.count,
        books: BookCatalog.where(active: true).count
---
SELECT COUNT(*) FROM "book_catalog" WHERE "book_catalog"."active" = TRUE