app/controllers/admin/items_controller.rb

    def index
      @items = Item.includes(:passage).order(created_at: :desc)
---
SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC

    def set_passage
      @passage = Passage.find(params[:passage_id]) if params[:passage_id]
---
SELECT "passages".* FROM "passages" WHERE "passages"."id" = 1 LIMIT 1

    def set_item
      @item = @passage ? @passage.items.find(params[:id]) : Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."passage_id" = 1 AND "items"."id" = 1 LIMIT 1