app/controllers/admin/passages_controller.rb

    def index
      @passages = Passage.order(created_at: :desc)
---
SELECT "passages".* FROM "passages" ORDER BY "passages"."created_at" DESC

    def set_passage
      @passage = Passage.find(params[:id])
---
SELECT "passages".* FROM "passages" WHERE "passages"."id" = 1 LIMIT 1