app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
      @users = User.order(created_at: :desc)