app/presenters/report_presenter.rb

  def item_rows
    return [] unless submission

    scoring_by_item = submission.scoring_results.index_by(&:item_id)
    submission.responses.includes(:item).map do |response|
---
SELECT "scoring_results".* FROM "scoring_results" WHERE "scoring_results"."submission_id" = 1
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)
SELECT "responses".* FROM "responses" WHERE "responses"."submission_id" = 1