app/views/admin/passages/index.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."passage_id" = 1
---
          <td><%= passage.grade_band %></td>
          <td><%= passage.items.count %></td>