app/controllers/parent/dashboard_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
    def index
      @children = User.where(id: linked_student_ids)