app/controllers/parent/reports_controller.rb

    def index
      submission_ids = Submission.where(student_id: linked_student_ids).pluck(:id)
      @reports = Report.where(scope: "student", submission_id: submission_ids).includes(submission: :student)
---
SELECT "submissions"."id" FROM "submissions" WHERE "submissions"."student_id" = 4
SELECT "reports".* FROM "reports" WHERE "reports"."scope" = 'student' AND "reports"."submission_id" = 1