app/views/teacher/sessions/_form.html.erb

    <%= f.label :assessment_version_id, "평가 버전" %>
    <%= f.collection_select :assessment_version_id, AssessmentVersion.where(status: "published"), :id, :name, { prompt: "버전 선택" }, required: true %>
---
SELECT "assessment_versions".* FROM "assessment_versions" WHERE "assessment_versions"."status" = 'published'

    <%= f.label :school_id, "학교" %>
    <%= f.collection_select :school_id, School.all, :id, :name, { prompt: "학교 선택" }, required: true %>
---
SELECT "schools".* FROM "schools"

    <%= f.label :class_id, "학급" %>
    <%= f.collection_select :class_id, SchoolClass.all, :id, ->(c) { "#{c.grade} - #{c.name}" }, { prompt: "학급 선택" }, required: true %>
---
SELECT "classes".* FROM "classes"