app/views/teacher/sessions/index.html.erb

          <td><code><%= session.access_code %></code></td>
          <td><%= session.submissions.count %></td>
---
SELECT COUNT(*) FROM "submissions" WHERE "submissions"."session_id" = 1