app/views/admin/assessment_versions/index.html.erb

          </td>
          <td><%= version.assessment_version_items.count %></td>
---
SELECT "assessment_versions".* FROM "assessment_versions" ORDER BY "assessment_versions"."created_at" DESC
SELECT COUNT(*) FROM "assessment_version_items" WHERE "assessment_version_items"."assessment_version_id" = 1