app/views/admin/assessment_versions/show.html.erb

    <tbody>
      <% @assessment_version.assessment_version_items.includes(item: :passage).order(:order_no).each do |avi| %>
---
SELECT "assessment_version_items".* FROM "assessment_version_items" WHERE "assessment_version_items"."assessment_version_id" = 1 ORDER BY "assessment_version_items"."order_no" ASC
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)