app/views/teacher/reports/index.html.erb

SELECT "submissions".* FROM "submissions" WHERE "submissions"."status" = 'submitted'
---

  <% pending_submissions = Submission.where(status: "submitted").includes(:student, session: :assessment_version) %>

SELECT "reports".* FROM "reports" WHERE "reports"."submission_id" = 1 AND "reports"."scope" = 'student' LIMIT 1
---
        <% pending_submissions.each do |sub| %>
          <% existing_report = Report.find_by(submission: sub, scope: "student") %>