app/services/ai/response_cache.rb

SELECT COUNT(*) FROM "ai_feedback_runs"
SELECT COUNT(*) FROM "ai_feedback_runs" WHERE "ai_feedback_runs"."status" = 'success'
SELECT COUNT(*) FROM "ai_feedback_runs" WHERE "ai_feedback_runs"."status" = 'failed'
---
    def stats
      total = AiFeedbackRun.count
      hits = AiFeedbackRun.where(status: "success").count
      failures = AiFeedbackRun.where(status: "failed").count