app/controllers/student/assessments_controller.rb

    def index
      @active_sessions = Session.where(status: "active")
      @my_submissions = current_user.submissions.includes(session: :assessment_version)
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."student_id" = 4

    def take
      @items = @session.assessment_version.items.includes(:passage)
---
SELECT "items".* FROM "items" INNER JOIN "assessment_version_items" ON "items"."id" = "assessment_version_items"."item_id" WHERE "assessment_version_items"."assessment_version_id" = 1

    def set_submission
      @submission = current_user.submissions.find_or_create_by!(session: @session) do |s|
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."student_id" = 4 AND "submissions"."session_id" = 1 LIMIT 1