app/controllers/student/dashboard_controller.rb

    def index
      @active_sessions = Session.where(status: "active")
      @my_submissions = current_user.submissions.order(created_at: :desc).limit(5)
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."student_id" = 4 ORDER BY "submissions"."created_at" DESC LIMIT 5