app/controllers/student/reports_controller.rb

    def index
      submission_ids = current_user.submissions.pluck(:id)
      @reports = Report.where(scope: "student", submission_id: submission_ids)
---
SELECT "submissions"."id" FROM "submissions" WHERE "submissions"."student_id" = 4
SELECT "reports".* FROM "reports" WHERE "reports"."scope" = 'student' AND "reports"."submission_id" = 1