app/controllers/reports_controller.rb

  def set_report
    @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = 1 LIMIT 1

  def user_access?
    return false unless current_user

    ReportAccess.exists?(report: @report, subject_user: current_user)
---
SELECT 1 AS one FROM "report_access" WHERE "report_access"."report_id" = 1 AND "report_access"."subject_user_id" = 4 LIMIT 1