app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email_optional" = 'student1@test.com' LIMIT 1
---
  def create
    user = User.find_by(email_optional: params[:email])