app/controllers/school_manager/dashboard_controller.rb

SELECT "submissions".* FROM "submissions" WHERE "submissions"."status" = 'submitted' ORDER BY "submissions"."submitted_at" DESC LIMIT 10
---
    def index
      # 기본 통계
      @stats = calculate_basic_stats

      # 최근 세션들
      @recent_sessions = Session.includes(:school, :assessment_version)
                                .order(created_at: :desc)
                                .limit(5)

      # 영역별 통계 (모든 세션 집계)
      @domain_stats = calculate_domain_stats

      # 학급별 참여율
      @class_participation = calculate_class_participation

      # 최근 제출물
      @recent_submissions = Submission.includes(:student, session: :assessment_version)
                                      .where(status: "submitted")
                                      .order(submitted_at: :desc)
                                      .limit(10)

SELECT COUNT(*) FROM "submissions" WHERE "submissions"."status" = 'submitted'
SELECT COUNT(*) FROM "submissions"
SELECT COUNT(*) FROM "reports" WHERE "reports"."scope" = 'student'
---
    def calculate_basic_stats
      total_students = User.students.count
      completed_submissions = Submission.where(status: "submitted").count
      total_submissions = Submission.count

      {
        students: total_students,
        classes: SchoolClass.count,
        sessions: Session.count,
        active_sessions: Session.where(status: "active").count,
        reports: Report.count,
        school_reports: Report.where(scope: "school").count,
        student_reports: Report.where(scope: "student").count,
        submissions_total: total_submissions,
        submissions_completed: completed_submissions,
        completion_rate: total_submissions > 0 ? (completed_submissions.to_f / total_submissions * 100).round(1) : 0,
        average_score: calculate_average_score

SELECT 1 AS one FROM "scoring_results" INNER JOIN "submissions" ON "submissions"."id" = "scoring_results"."submission_id" WHERE "submissions"."status" = 'submitted' LIMIT 1
SELECT SUM("scoring_results"."score") FROM "scoring_results" INNER JOIN "submissions" ON "submissions"."id" = "scoring_results"."submission_id" WHERE "submissions"."status" = 'submitted'
SELECT COUNT(*) FROM "scoring_results" INNER JOIN "submissions" ON "submissions"."id" = "scoring_results"."submission_id" WHERE "submissions"."status" = 'submitted'
---
    def calculate_average_score
      results = ScoringResult.joins(:submission).where(submissions: { status: "submitted" })
      return 0 unless results.any?

      total_score = results.sum(:score)
      total_items = results.count

SELECT AVG("analytics_domain_agg"."avg") AS "average_avg", "analytics_domain_agg"."domain" AS "analytics_domain_agg_domain" FROM "analytics_domain_agg" GROUP BY "analytics_domain_agg"."domain"
---
    def calculate_domain_stats
      # 영역별 평균 점수 집계
      AnalyticsDomainAgg.select(:domain)
                        .group(:domain)
                        .average(:avg)
                        .transform_values { |v| v&.round(1) || 0 }

SELECT "classes".* FROM "classes"
SELECT "student_profiles".* FROM "student_profiles" WHERE "student_profiles"."class_id" = 1
SELECT COUNT(*) FROM "submissions" WHERE "submissions"."student_id" = 4 AND "submissions"."status" = 'submitted'
---
    def calculate_class_participation
      SchoolClass.includes(:student_profiles).map do |school_class|
        student_ids = school_class.student_profiles.pluck(:student_id)
        total_students = student_ids.count
        next nil if total_students == 0

        submitted_count = Submission.where(student_id: student_ids, status: "submitted").count

SELECT 1 AS one FROM "metrics_results" LIMIT 1
SELECT "metrics_results".* FROM "metrics_results"
---
    def calculate_grade_distribution
      # 등급별 학생 수 분포
      metrics = MetricsResult.includes(:submission).all
      return {} unless metrics.any?

      distribution = { "A" => 0, "B" => 0, "C" => 0, "D" => 0, "F" => 0 }

      metrics.each do |m|

SELECT AVG("analytics_subskill_agg"."avg") AS "average_avg", "analytics_subskill_agg"."subskill" AS "analytics_subskill_agg_subskill" FROM "analytics_subskill_agg" GROUP BY "analytics_subskill_agg"."subskill"
---
    def calculate_weak_areas
      AnalyticsSubskillAgg.select(:subskill)
                          .group(:subskill)
                          .average(:avg)
                          .sort_by { |_, v| v || 0 }
                          .first(5)
                          .map { |k, v| { subskill: k, avg: v&.round(1) || 0 } }