app/controllers/school_manager/students_controller.rb

    def index
      @students = User.students.includes(:student_profile).order(:name)
      @students = @students.where("name LIKE ?", "%#{params[:q]}%") if params[:q].present?
---
SELECT "student_profiles".* FROM "student_profiles" WHERE "student_profiles"."student_id" = 4

    def set_student
      @student = User.students.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1