app/services/scoring/percentile_calculator.rb

    def calculate
      domain_scores = @submission.metrics_result&.domain_scores_json || {}
      return empty_result if domain_scores.empty?
---
SELECT "metrics_results".* FROM "metrics_results" WHERE "metrics_results"."submission_id" = 1 LIMIT 1

    def collect_comparison_scores
      domain_scores_list = {}
      overall_scores = []

      if @session
        submissions = @session.submissions
          .where(status: "submitted")
          .includes(:metrics_result)

        submissions.each do |sub|
---
SELECT "metrics_results".* FROM "metrics_results" WHERE "metrics_results"."submission_id" = 1
SELECT "submissions".* FROM "submissions" WHERE "submissions"."session_id" = 1 AND "submissions"."status" = 'submitted'